In [2]:
import pandas as pd

In [3]:
#read and show the dataset
df = pd.read_csv('gdp.csv', encoding='latin1')
df

      unid wbid      country  year        SES       gdppc  yrseduc  popshare
0        4  AFG  Afghanistan  1970   3.474212   709.00000      NaN  0.003097
1        4  AFG  Afghanistan  1920  26.968016   731.75677      NaN  0.003245
2        4  AFG  Afghanistan  1990   1.269530   604.00000      NaN  0.002347
3        4  AFG  Afghanistan  1960  15.763076   739.00000      NaN  0.003039
4        4  AFG  Afghanistan  2000   2.061114   565.00000      NaN  0.003309
...    ...  ...          ...   ...        ...         ...      ...       ...
2081   716  ZWE     Zimbabwe  1940  52.746567   813.00000      NaN  0.001113
2082   716  ZWE     Zimbabwe  2010  27.091389  1388.97300      NaN  0.002074
2083   716  ZWE     Zimbabwe  1990  59.110970  2526.07230      NaN  0.002039
2084   716  ZWE     Zimbabwe  1900  54.722645   601.00000      NaN  0.000996
2085   716  ZWE     Zimbabwe  1960  53.811077   938.00000      NaN  0.001268

[2086 rows x 8 columns]

In [4]:
#reshape the dataframe with pivot
df = df.pivot(index='year', columns='country', values='gdppc')

# 2 Pivot Table

In [8]:
#read and show the dataset
df = pd.read_excel('supermarket_sales.xlsx')
df
#df.plot(kind='line')
#strip any hidden

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,2019-01-05,13:08:00,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,2019-03-08,10:29:00,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,2019-03-03,13:23:00,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,2019-01-27,20:33:00,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2019-02-08,10:37:00,Ewallet,604.17,4.761905,30.2085,5.3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,233-67-5758,C,Naypyitaw,Normal,Male,Health and beauty,40.35,1,2.0175,42.3675,2019-01-29,13:46:00,Ewallet,40.35,4.761905,2.0175,6.2
996,303-96-2227,B,Mandalay,Normal,Female,Home and lifestyle,97.38,10,48.6900,1022.4900,2019-03-02,17:16:00,Ewallet,973.80,4.761905,48.6900,4.4
997,727-02-1313,A,Yangon,Member,Male,Food and beverages,31.84,1,1.5920,33.4320,2019-02-09,13:22:00,Cash,31.84,4.761905,1.5920,7.7
998,347-56-2442,A,Yangon,Normal,Male,Home and lifestyle,65.82,1,3.2910,69.1110,2019-02-22,15:33:00,Cash,65.82,4.761905,3.2910,4.1
999,849-09-3807,A,Yangon,Member,Female,Fashion accessories,88.34,7,30.9190,649.2990,2019-02-18,13:28:00,Cash,618.38,4.761905,30.9190,6.6

In [21]:
#clean column names 
df.columns = df.columns.str.strip()
#Total sales by Gender
df.pivot_table(values='Total', index='Gender', aggfunc='sum', margins=True)

             Total
Gender
Female  167882.925
Male    155083.824
All     322966.749

In [22]:
#Total sales by City and Gender
df.pivot_table(values='Total', index='City', columns='Gender', aggfunc='sum', margins=True)

Gender         Female         Male          All
City
Mandalay    52928.295   53269.3770  106197.6720
Naypyitaw   61685.463   48883.2435  110568.7065
Yangon      53269.167   52931.2035  106200.3705
All        167882.925  155083.8240  322966.7490

In [24]:
#Average rating by Product line and Customer Type
df.pivot_table(values='Rating', index='Product line', columns='Customer type', aggfunc='mean')

Customer type             Member    Normal
Product line
Electronic accessories  6.950000  6.903261
Fashion accessories     6.946512  7.106522
Food and beverages      6.996809  7.250000
Health and beauty       7.078082  6.934177
Home and lifestyle      6.868675  6.803896
Sports and travel       6.817241  7.025316

In [25]:
#select some columns
df.pivot_table(index='Gender', values=['Quantity', 'Total'], aggfunc='sum')

        Quantity       Total
Gender
Female      2869  167882.925
Male        2641  155083.824